In [83]:
import requests
dist={}
for i in range(1,719):
    response=requests.get('https://cdn-api.co-vin.in/api/v2/appointment/sessions/public/findByDistrict?',params={'district_id':str(i),'date':'18-06-2021'})
    for k in response.json()['sessions']:
        dist[i]=[]
        dist[i].extend([i,k['district_name']])
        break

In [104]:
import requests
dist1={}
for i in range(1,719):
    response=requests.get('https://cdn-api.co-vin.in/api/v2/appointment/sessions/public/findByDistrict?',params={'district_id':str(i),'date':'19-06-2021'})
    for k in response.json()['sessions']:
        dist1[i]=[]
        dist1[i].extend([i,k['district_name']])
        break

In [105]:
df1=pd.DataFrame(dist1,index=['district_id','distict']).T

In [106]:
df1.reset_index(drop='index',inplace=True)

In [120]:
df1

    district_id                            distict
0             2                      South Andaman
1             5                             Guntur
2             7                            Kurnool
3             8                      Visakhapatnam
4            10                           Chittoor
..          ...                                ...
368         712    Basirhat HD (North 24 Parganas)
369         713                            Birbhum
370         714             Bishnupur HD (Bankura)
371         716                   Dakshin Dinajpur
372         718  Diamond Harbor HD (S 24 Parganas)

[373 rows x 2 columns]

In [117]:
df=pd.DataFrame(dist,index=['district_id','distict']).T

In [118]:
df.reset_index(drop='index',inplace=True)

In [122]:
df

    district_id                         distict
0             1        North and Middle Andaman
1             2                   South Andaman
2             4                         Krishna
3             5                          Guntur
4             6  YSR District Kadapa (Cuddapah)
..          ...                             ...
171         351                           Bhind
172         353                           Katni
173         355                         Vidisha
179         378                          Gondia
196         410                         Jiribam

[622 rows x 2 columns]

In [124]:
len(df['district_id'].unique())

622

In [121]:
for k in df1['district_id']:
    if k not in list(df['district_id']):
        df=pd.concat([df,df1[df1['district_id']==k]])

In [82]:
df=pd.DataFrame([dist]).T

In [ ]:
df.in

In [66]:
dist={}
for k in  response.json()['sessions']: 
    dist[1]=k['district_name']
    print(k['district_name'])

North and Middle Andaman
North and Middle Andaman
North and Middle Andaman

In [67]:
dist

{1: 'North and Middle Andaman'}

In [41]:
f=set()
f.update({1,2,3})

In [44]:
f.update({3})

In [45]:
f

{1, 2, 3}

In [50]:
f={1:[1,2,3]}

In [51]:
f

{1: [1, 2, 3]}

In [52]:
import pandas as pd

In [55]:
pd.DataFrame(f)

   1
0  1
1  2
2  3

In [58]:
pd.DataFrame([{1:2,7:8}]).T

   0
1  2
7  8

In [103]:
list({1,2,3})

[1, 2, 3]